app/controllers/businesses_controller.rb

SELECT * FROM "businesses"
---
  def index
    @businesses = Business.all

SELECT * FROM "businesses" WHERE ("businesses"."id" = 1)
---
  def show
    @businesses = Business.find(params[:id].split(','))

SELECT * FROM "businesses" WHERE ("businesses"."id" = 1)
---
  def edit
    @business = Business.find(params[:id])

INSERT INTO "businesses" ("name", "updated_at", "lng", "address", "lat", "geolocalized_address", "created_at") VALUES('', '2009-05-01 08:48:02', 110.983333, 'Lin, 临县, Lüliang, Shanxi, China', 37.95, 'Lin, 临县, Lüliang, Shanxi, China', '2009-05-01 08:48:02')
---
  def create
    @business = Business.new(params[:business])

    respond_to do |format|
      if @business.save

SELECT * FROM "businesses" WHERE ("businesses"."id" = 1)
UPDATE "businesses" SET "geolocalized_address" = 'Lincoln, Illinois, USA', "lng" = -89.367844, "lat" = 40.146972, "address" = 'Lincoln, Illinois, USA', "updated_at" = '2009-05-01 08:22:27' WHERE "id" = 4
---
  def update
    @business = Business.find(params[:id])

    respond_to do |format|
      if @business.update_attributes(params[:business])

SELECT * FROM "businesses" WHERE ("businesses"."id" = 2)
DELETE FROM "businesses" WHERE "id" = 2
---
  def destroy
    @business = Business.find(params[:id])
    @business.destroy